## Датасет собран из базы данных переписи 1994 года и содержит данные о доходах.
### Информация о данных:
* age: continuous.
* workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
* fnlwgt: continuous.
* education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, * Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
* education-num: continuous.
* marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
* occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
* relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
* race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
* sex: Female, Male.
* capital-gain: continuous.
* capital-loss: continuous.
* hours-per-week: continuous.
* native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.
* salary: >50K,<=50K

## Проведите анализ данных при помощи Pandas выполнив поставленные задачи.
####

In [2]:
import pandas as pd

In [3]:
# загружаем датасет
data = pd.read_csv("./data/adult.data.csv")
data.head(10)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K
7,52,Self-emp-not-inc,209642,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,45,United-States,>50K
8,31,Private,45781,Masters,14,Never-married,Prof-specialty,Not-in-family,White,Female,14084,0,50,United-States,>50K
9,42,Private,159449,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K

**1. Посчитайте, сколько мужчин и женщин (признак *sex*) представлено в этом датасете**

In [4]:
data["sex"].value_counts()

sex
Male      21790
Female    10771
Name: count, dtype: int64

**2. Каков средний возраст мужчин (признак *age*) по всему датасету?**

In [5]:
avg_male_age = data.loc[data['sex'] == 'Male', 'age'].mean()
print(round(avg_male_age, 3))

39.434

**3. Какова доля граждан Соединенных Штатов (признак *native-country*)?**

In [6]:
# Доли всех стран
countries_share = data['native-country'].value_counts(normalize=True)

# Только США
usa_share = countries_share['United-States']

print(f"USA natives: {usa_share:.2%}")

USA natives: 89.59%

**4-5. Рассчитайте среднее значение и среднеквадратичное отклонение возраста тех, кто получает более 50K в год (признак *salary*) и тех, кто получает менее 50K в год**

In [7]:
statistics = data.groupby('salary')['age'].agg(['mean', 'std'])
statistics.round(3)

          mean     std
salary
<=50K   36.784  14.020
>50K    44.250  10.519

**6. Правда ли, что люди, которые получают больше 50k, имеют минимум высшее образование? (признак *education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* или *Doctorate*)**

In [8]:
higher_edu = ['Bachelors','Prof-school', 'Assoc-acdm', 'Assoc-voc', 'Masters', 'Doctorate']
rich_eduction = data.loc[data['salary'] == '>50K','education']
is_true = rich_eduction.isin(higher_edu).all()
print(f"Rich people - higher education?: {is_true}")

Rich people - higher education?: False

In [9]:
# Показать уникальные виды образования среди тех, кто зарабатывает >50K
print(f"Other education: {data.loc[data['salary'] == '>50K', 'education'].unique()}")

Other education: ['HS-grad' 'Masters' 'Bachelors' 'Some-college' 'Assoc-voc' 'Doctorate'
 'Prof-school' 'Assoc-acdm' '7th-8th' '12th' '10th' '11th' '9th' '5th-6th'
 '1st-4th']

**7. Выведите статистику возраста для каждой расы (признак *race*) и каждого пола. Используйте *groupby* и *describe*. Найдите таким образом максимальный возраст мужчин расы *Asian-Pac-Islander*.**

In [10]:
# Группируем по двум колонкам и берем статистику возраста
age_by_race_sex_statistics = data.groupby(['race', 'sex'])['age'].describe()
age_by_race_sex_statistics

                             count       mean        std   min   25%   50%  \
race               sex
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                   Male      192.0  37.208333  12.049563  17.0  28.0  35.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                   Male      693.0  39.073593  12.883944  18.0  29.0  37.0
Black              Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                   Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
Other              Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                   Male      162.0  34.654321  11.355531  17.0  26.0  32.0
White              Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                   Male    19174.0  39.652498  13.436029  17.0  29.0  38.0

                             75%   max
race               sex
Amer-Indian-Eskimo Female  46.00  80.0
                   Male    45.00  82.0
Asian-Pac-Islander Female  43.75  75.0
                   Male    46.00  90.0
Black              Female  46.00  90.0
                   Male    46.00  90.0
Other              Female  39.00  74.0
                   Male    42.00  77.0
White              Female  46.00  90.0
                   Male    49.00  90.0

In [11]:
max_age_asian_male = age_by_race_sex_statistics.loc[('Asian-Pac-Islander', 'Male'), 'max']
print(f"Max age: {max_age_asian_male:.3f}")

Max age: 90.000

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак *marital-status*)? Женатыми считаем тех, у кого *marital-status* начинается с *Married* (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [12]:
men_only = data[data['sex'] == 'Male'].copy()

#Создаем признак через лямбда-функцию
men_only['is_married'] = men_only['marital-status'].apply(lambda x: 'Married' if x.startswith('Married') else 'Single')

wealth_share = men_only.groupby('is_married')['salary'].value_counts(normalize=True)
wealth_share

is_married  salary
Married     <=50K     0.559486
            >50K      0.440514
Single      <=50K     0.915505
            >50K      0.084495
Name: proportion, dtype: float64

In [13]:
married_share = wealth_share['Married', '>50K']
single_share = wealth_share['Single', '>50K']

if married_share > single_share:
    print("More rich married men")
else:
    print("More rich single men")

More rich married men

**9. Какое максимальное число часов человек работает в неделю (признак *hours-per-week*)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [14]:
# Максимум часов в неделю
max_hours = data['hours-per-week'].max()
print(f"Max hours per week: {max_hours}")

Max hours per week: 99

In [15]:
# Выбираем работяг, которые работают максимум часов в неделю
workers_max_hours = data.loc[data['hours-per-week'] == max_hours]

# Считаем количесство бедолаг
count_workers_max_hours = len(workers_max_hours)
print(f"Workers count who work max hours per week: {count_workers_max_hours}")

Workers count who work max hours per week: 85

In [16]:
# Доля богатых (>50K) бедолаг
rich_workers_share = workers_max_hours['salary'].value_counts(normalize=True)
print(rich_workers_share * 100)

salary
<=50K    70.588235
>50K     29.411765
Name: proportion, dtype: float64

**10. Посчитайте среднее время работы (*hours-per-week*) зарабатывающих мало и много (*salary*) для каждой страны (*native-country*).**

In [28]:
income = data.groupby(['native-country','salary'])['hours-per-week'].mean().reset_index()
round(income, 3)

   native-country salary  hours-per-week
0               ?  <=50K          40.165
1               ?   >50K          45.548
2        Cambodia  <=50K          41.417
3        Cambodia   >50K          40.000
4          Canada  <=50K          37.915
..            ...    ...             ...
77  United-States   >50K          45.505
78        Vietnam  <=50K          37.194
79        Vietnam   >50K          39.200
80     Yugoslavia  <=50K          41.600
81     Yugoslavia   >50K          49.500

[82 rows x 3 columns]

**11.Сгруппируйте людей по возрастным группам *young*, *adult*, *retiree*, где:**
* *young* соответствует 16-35 лет
* *adult* - 35-70 лет
* *retiree* - 70-100 лет

**Проставьте название соответсвтуещей группы для каждого человека в новой колонке AgeGroup**

In [18]:
# (16, 34] - young
bins = [16, 34, 70, 100]
labels = ['young', 'adult', 'retiree']

# include_lowest - чтобы включить 16-летних
data['AgeGroup'] = pd.cut(data['age'], bins=bins, labels=labels, include_lowest=True)

data[['age', 'AgeGroup']]

       age AgeGroup
0       39    adult
1       50    adult
2       38    adult
3       53    adult
4       28    young
...    ...      ...
32556   27    young
32557   40    adult
32558   58    adult
32559   22    young
32560   52    adult

[32561 rows x 2 columns]

**12-13. Определите количество зарабатывающих >50K в каждой из возрастных групп (колонка AgeGroup), а также выведите название возрастной группы, в которой чаще зарабатывают больше 50К (>50K)**

In [19]:
rich = data[data['salary'] == '>50K']
rich_age_groups = rich.groupby('AgeGroup', observed=False).size().reset_index(name='count')

print(f"Age groups that make >50K:\n")
rich_age_groups

Age groups that make >50K:

  AgeGroup  count
0    young   1488
1    adult   6259
2  retiree     94

In [20]:
name_rich_age_group = data.groupby('AgeGroup', observed=False)['salary'].value_counts(normalize=True)
max_rich = name_rich_age_group.loc[:,'>50K'].idxmax()
max_rich

'adult'

**14. Сгруппируйте людей по типу занятости (колонка occupation) и определите количество людей в каждой группе. После чего напишите функциюю фильтрации filter_func, которая будет возвращать только те группы, в которых средний возраст (колонка age) не больше 40 и в которых все работники отрабатывают более 5 часов в неделю (колонка hours-per-week)**

In [21]:
occupation_groups = data.groupby('occupation')
occupation_groups.size().reset_index(name='count')

           occupation  count
0                   ?   1843
1        Adm-clerical   3770
2        Armed-Forces      9
3        Craft-repair   4099
4     Exec-managerial   4066
5     Farming-fishing    994
6   Handlers-cleaners   1370
7   Machine-op-inspct   2002
8       Other-service   3295
9     Priv-house-serv    149
10     Prof-specialty   4140
11    Protective-serv    649
12              Sales   3650
13       Tech-support    928
14   Transport-moving   1597

In [22]:
def filter_func(group_to_filter):
    avg_age = group_to_filter['age'].mean() <= 40
    all_work_enough = (group_to_filter['hours-per-week'] > 5).all()

    return avg_age and all_work_enough

filtered_data = occupation_groups.filter(filter_func)
filtered_data['occupation'].unique()

array(['Armed-Forces'], dtype=object)